benchmark/batchSize/first/1.log
352922 records sent, 70584.4 records/sec (6.73 MB/sec), 2288.0 ms avg latency, 3423.0 max latency.
961480 records sent, 191912.2 records/sec (18.30 MB/sec), 3424.4 ms avg latency, 4455.0 max latency.
1530295 records sent, 306059.0 records/sec (29.19 MB/sec), 1590.2 ms avg latency, 1893.0 max latency.
1651715 records sent, 330343.0 records/sec (31.50 MB/sec), 1388.5 ms avg latency, 1593.0 max latency.
1516710 records sent, 303342.0 records/sec (28.93 MB/sec), 1617.2 ms avg latency, 1781.0 max latency.
1588860 records sent, 317772.0 records/sec (30.31 MB/sec), 1587.9 ms avg latency, 1719.0 max latency.
1326845 records sent, 265369.0 records/sec (25.31 MB/sec), 1867.3 ms avg latency, 2033.0 max latency.
1580264 records sent, 316052.8 records/sec (30.14 MB/sec), 1683.0 ms avg latency, 1972.0 max latency.
1585431 records sent, 317086.2 records/sec (30.24 MB/sec), 1375.1 ms avg latency, 1434.0 max latency.
1544855 records sent, 308971.0 records/sec (29.47 MB/sec), 1285.5 ms avg latency, 1512.0 max latency.
1533935 records sent, 306787.0 records/sec (29.26 MB/sec), 1646.9 ms avg latency, 1776.0 max latency.
1607060 records sent, 321412.0 records/sec (30.65 MB/sec), 1596.6 ms avg latency, 1748.0 max latency.
1493635 records sent, 298727.0 records/sec (28.49 MB/sec), 1733.5 ms avg latency, 1792.0 max latency.
1577680 records sent, 315536.0 records/sec (30.09 MB/sec), 1706.1 ms avg latency, 1819.0 max latency.
1623830 records sent, 324766.0 records/sec (30.97 MB/sec), 1532.3 ms avg latency, 1685.0 max latency.
1751955 records sent, 350391.0 records/sec (33.42 MB/sec), 1462.3 ms avg latency, 1675.0 max latency.
1574615 records sent, 314923.0 records/sec (30.03 MB/sec), 982.9 ms avg latency, 1156.0 max latency.
1452880 records sent, 290576.0 records/sec (27.71 MB/sec), 1182.3 ms avg latency, 1455.0 max latency.
1505465 records sent, 300672.1 records/sec (28.67 MB/sec), 1096.1 ms avg latency, 1468.0 max latency.
1613430 records sent, 322686.0 records/sec (30.77 MB/sec), 718.9 ms avg latency, 896.0 max latency.
1608620 records sent, 321724.0 records/sec (30.68 MB/sec), 785.1 ms avg latency, 912.0 max latency.
1608555 records sent, 321711.0 records/sec (30.68 MB/sec), 664.7 ms avg latency, 798.0 max latency.
1637870 records sent, 327574.0 records/sec (31.24 MB/sec), 551.6 ms avg latency, 723.0 max latency.
1506765 records sent, 301353.0 records/sec (28.74 MB/sec), 801.7 ms avg latency, 1388.0 max latency.
1542450 records sent, 308490.0 records/sec (29.42 MB/sec), 1392.3 ms avg latency, 1672.0 max latency.
1526850 records sent, 305370.0 records/sec (29.12 MB/sec), 1691.1 ms avg latency, 1831.0 max latency.
1608100 records sent, 321620.0 records/sec (30.67 MB/sec), 1170.6 ms avg latency, 1410.0 max latency.
1533220 records sent, 306644.0 records/sec (29.24 MB/sec), 1219.5 ms avg latency, 1328.0 max latency.
1544075 records sent, 308075.6 records/sec (29.38 MB/sec), 1297.4 ms avg latency, 1571.0 max latency.
1536730 records sent, 307346.0 records/sec (29.31 MB/sec), 1346.9 ms avg latency, 1594.0 max latency.
1569490 records sent, 313459.2 records/sec (29.89 MB/sec), 1609.7 ms avg latency, 1762.0 max latency.
1502605 records sent, 300521.0 records/sec (28.66 MB/sec), 1730.8 ms avg latency, 1806.0 max latency.
1690260 records sent, 338052.0 records/sec (32.24 MB/sec), 1565.7 ms avg latency, 1728.0 max latency.
50000000 records sent, 301792.041140 records/sec (28.78 MB/sec), 1394.32 ms avg latency, 4455.00 ms max latency, 1432 ms 50th, 1816 ms 95th, 3593 ms 99th, 4324 ms 99.9th.