benchmark/batchSize/first/4.log
3022529 records sent, 604505.8 records/sec (57.65 MB/sec), 3.1 ms avg latency, 145.0 max latency.
3567886 records sent, 713577.2 records/sec (68.05 MB/sec), 3.1 ms avg latency, 131.0 max latency.
3611239 records sent, 722247.8 records/sec (68.88 MB/sec), 2.2 ms avg latency, 20.0 max latency.
3607633 records sent, 721526.6 records/sec (68.81 MB/sec), 2.4 ms avg latency, 101.0 max latency.
3487060 records sent, 697412.0 records/sec (66.51 MB/sec), 2.2 ms avg latency, 13.0 max latency.
3611045 records sent, 722209.0 records/sec (68.88 MB/sec), 2.2 ms avg latency, 36.0 max latency.
2939538 records sent, 385361.6 records/sec (36.75 MB/sec), 2.8 ms avg latency, 3572.0 max latency.
3798577 records sent, 759715.4 records/sec (72.45 MB/sec), 3.3 ms avg latency, 3573.0 max latency.
3786930 records sent, 757386.0 records/sec (72.23 MB/sec), 2.0 ms avg latency, 14.0 max latency.
3698761 records sent, 739752.2 records/sec (70.55 MB/sec), 2.2 ms avg latency, 88.0 max latency.
3726625 records sent, 745325.0 records/sec (71.08 MB/sec), 2.2 ms avg latency, 21.0 max latency.
3571958 records sent, 714391.6 records/sec (68.13 MB/sec), 2.8 ms avg latency, 126.0 max latency.
3677438 records sent, 735487.6 records/sec (70.14 MB/sec), 2.3 ms avg latency, 28.0 max latency.
3498170 records sent, 699634.0 records/sec (66.72 MB/sec), 2.6 ms avg latency, 109.0 max latency.
50000000 records sent, 683088.104704 records/sec (65.14 MB/sec), 2.53 ms avg latency, 3573.00 ms max latency, 2 ms 50th, 3 ms 95th, 9 ms 99th, 82 ms 99.9th.